app/Controllers/Admin.php

SELECT *
FROM `jenjang_pendidikan`
---
    public function profil_pencaker()
    {

        // $pencakerModel = new PencakerModel();
        // $pencaker = $pencakerModel->find($id);


        // $pendidikanModel = new PendidikanModel();
        // $pendidikan = $pendidikanModel->where('pencaker_id', $id)->findAll();

        // $pengalamanModel = new PengalamanKerjaModel();
        // $pengalaman = $pengalamanModel->where('pencaker_id', $id)->findAll();

        // $dokumenModel = new DokumenPencakerModel();
        // $dokumen = $dokumenModel->where('pencaker_id', $id)->findAll();

        $jenjangPendidikan = new JenjangpendidikanModel();
        $jenjang = $jenjangPendidikan->findAll();