app/Controllers/Frontend.php

    public function berita(): string
    {
        $informasiModel = new FrontendModel();

        // Pagination configuration
        $perPage = 3;
        $currentPage = $this->request->getVar('page') ? (int)$this->request->getVar('page') : 1;

        // Ambil data informasi berita
        $kategori = 'berita'; // Kategori yang ingin ditampilkan
        $totalRows = $informasiModel->countInformasiByKategori($kategori);
---
SELECT COUNT(*) AS `numrows`
FROM `informasi`