app/Models/FrontendModel.php

SELECT *
FROM `informasi`
WHERE `kategori` = 'berita'
 LIMIT 3
---
    public function getInformasiByKategori($kategori, $limit, $offset)
    {
        return $this->db->table('informasi')
            ->where('kategori', $kategori)
            ->limit($limit, $offset)
            ->get()
            ->getResultArray();

UPDATE `informasi` SET `judul` = 'Sekda Manokwari ingatkan sekolah wajib hindari praktik pungli pada PPDB', `isi` = 'Manokwari (ANTARA) - Sekretaris Daerah (Sekda) Manokwari, Provinsi Papua Barat, Henri Sembiring menyatakan sekolah wajib menghindari berbagai praktik yang bisa dikategorikan sebagai pungutan liar (pungli) saat penerimaan peserta didik baru (PPDB).\r\n\r\n\"Kami memastikan PPDB di Kabupaten Manokwari gratis dan tidak dipungut biaya. Jangan sampai saat PPDB pihak sekolah melakukan praktik-praktik yang jatuhnya dikategorikan sebagai pungli,\" kata Henri di Manokwari, Selasa.\r\n\r\nIa menjelaskan salah satu upaya praktik yang sering dilakukan sekolah adalah melakukan pungutan pembelian uang seragam pada uang tua siswa saat PPDB.\r\n\r\nKewajiban pembelian uang seragam dari sekolah saat pendaftaran justru membuat sekolah terjebak pada praktik pungli.', `tags` = 'pungli, ppdb', `kategori` = 'berita', `status` = '1', `users_id` = '1', `gambar` = '1720414338_f1d89156606669e7d8b0.jpg'
WHERE `id` = '38'
---
    public function update($id = null, $data = null): bool
    {
        return $this->db->table('informasi')->where('id', $id)->update($data);