app/Models/PencakerModel.php

    public function savePencaker($data)
    {
        return $this->insert($data);
---
INSERT INTO `pencaker` (`namalengkap`, `nik`, `users_id`) VALUES ('TOLOMEUS', '9202151508870014', 52)

    public function countPencaker()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `pencaker`

    public function countByStatus($status)
    {
        return $this->where('keterangan_status', $status)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pencaker`
WHERE `keterangan_status` = 'Registrasi'

    public function countByPendidikan()
    {
        return $this->db->table('pendidikan_pencaker')
            ->select('jenjang_pendidikan.jenjang AS pendidikan_terakhir, COUNT(*) AS jumlah')
            ->join('jenjang_pendidikan', 'pendidikan_pencaker.jenjang_pendidikan_id = jenjang_pendidikan.id')
            ->groupBy('jenjang_pendidikan.jenjang')
            ->get()
            ->getResultArray();
---
SELECT `jenjang_pendidikan`.`jenjang` AS `pendidikan_terakhir`, COUNT(*) AS jumlah
FROM `pendidikan_pencaker`
JOIN `jenjang_pendidikan` ON `pendidikan_pencaker`.`jenjang_pendidikan_id` = `jenjang_pendidikan`.`id`
GROUP BY `jenjang_pendidikan`.`jenjang`

    public function countByUsia()
    {
        return $this->select("CASE
                                WHEN YEAR(CURDATE()) - YEAR(tgllahir) BETWEEN 18 AND 25 THEN '18-25'
                                WHEN YEAR(CURDATE()) - YEAR(tgllahir) BETWEEN 26 AND 35 THEN '26-35'
                                WHEN YEAR(CURDATE()) - YEAR(tgllahir) BETWEEN 36 AND 45 THEN '36-45'
                                WHEN YEAR(CURDATE()) - YEAR(tgllahir) > 45 THEN '46+'
                              END AS rentang_usia, COUNT(*) AS jumlah")
            ->groupBy('rentang_usia')
            ->findAll();
---
SELECT CASE
                                WHEN YEAR(CURDATE()) - YEAR(tgllahir) BETWEEN 18 AND 25 THEN '18-25'
                                WHEN YEAR(CURDATE()) - YEAR(tgllahir) BETWEEN 26 AND 35 THEN '26-35'
                                WHEN YEAR(CURDATE()) - YEAR(tgllahir) BETWEEN 36 AND 45 THEN '36-45'
                                WHEN YEAR(CURDATE()) - YEAR(tgllahir) > 45 THEN '46+'
                              END AS rentang_usia, COUNT(*) AS jumlah
FROM `pencaker`
GROUP BY `rentang_usia`