app/Models/UsersModel.php

    public function saveUser($data)
    {
        return $this->insert($data);
---
INSERT INTO `users` (`name`, `email`, `password`, `phone`) VALUES ('TOLOMEUS', 'TOLOMEUS@GMAIL.COM', '$2y$10$f48hI1L6kwwZoKqeaz9uM.DzwcnLJK5CnqvOZgw1K19Jxtj82ulJe', '081245503654')